package patternRegexp;

public class PatternRegexp {

    public static final String patternEquation = "((((-|\\+)?)(\\d+(?:[\\.,]\\d+)?)x\\^2)(((-|\\+){1}(\\d+(?:[\\.,]\\d+|)?))x)((-|\\+){1}(\\d+(?:[\\.,]\\d+|)?))=0){1}";
}

//mk1 - ((((-|\+)?)([\d]+|)x\^2)(((-|\+){1}([\d]+|))x)((-|\+){1}[\d]+)=0){1}
//mk2 - ((((-|\+)?)(\d+(?:[\.,]\d+)?)x\^2)(((-|\+){1}(\d+(?:[\.,]\d+|)?))x)((-|\+){1}(\d+(?:[\.,]\d+|)?))=0){1}

//        mk1
//4x^2+0x+1=0
//-4x^2+2x+1=0
//4x^2+2x+1=0
//-4x^2-2x-1=0
//44x^2+2x+1=0
//111x^2-222x-333=0
//111x^2+222x+333=0

//        mk2
//(\d+(?:[\.,]\d+)?)
//5675.3243x^2-8x+12=0
//5675.3243x^2-88888.8888x+12=0
//5675.3243x^2-88888.8888x+999.9999=0

//  {1} -не менее 1 раза.
//  + -один или более
//  | - или
//  ? - ноль или одно
//  * -ноль или более
//  ^ - начало строки
//  [0-9]* - 0 и более цифр
//  [.,] - точка или запятая
//  [,.]? - одна или ноль запятых или точек
//  [0-9]+ - 1 и более цифр
//  $ - конец строки.